/* ----------------------- 使用module为一个没有类型声明的模块添加类型声明 ----------------------- */
import pkg, { handler } from 'pkg'

const res = handler()

pkg()
/* ----------------------- 使用module为一个没有类型声明的模块添加类型声明 ----------------------- */

/* ------------------------------- 为md文件添加类型声明 ------------------------------ */
import md from './README.md'

const content = md.replace('NOTE', `NOTE${new Date().getDay()}`)

/* ------------------------------- 为md文件添加类型声明 ------------------------------ */

/* ---------------- 总结:declare module 通常用于为没有提供类型定义的库进行类型的补全, 如.css、.module.css、.png、.md 这一类， ---------------- */
